Catalogs/ГрафикиРаботы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>ГрафикиРаботы</Name>
			<Comment>Графики работы объектов предприятия</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БудНач</Name>
					<Comment>Будние дни: начало работы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БудКон</Name>
					<Comment>Будние дни: окончание работы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БудРежим</Name>
					<Comment>Будние дни: режим работы</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимРаботыОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БудЛокально</Name>
					<Comment>Локальные вызовы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубНач</Name>
					<Comment>Суббота: начало работы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубКон</Name>
					<Comment>Суббота: окончание работы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубРежим</Name>
					<Comment>Суббота: режим работы</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимРаботыОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СубЛокально</Name>
					<Comment>Локальные вызовы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВскНач</Name>
					<Comment>Воскресенье: начало работы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВскКон</Name>
					<Comment>Воскресенье: окончание работы</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Time</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВскРежим</Name>
					<Comment>Воскресенье: режим работы</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.РежимРаботыОбъекта</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВскЛокально</Name>
					<Comment>Локальные вызовы</Comment>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Enums/РежимРаботыОбъекта.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Enum>
		<Properties>
			<Name>РежимРаботыОбъекта</Name>
			<Comment>Режим работы объекта предприятия</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Выходной</Name>
					<Comment>Не работает</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Дежурный</Name>
					<Comment>Дежурный режим</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Рабочий</Name>
					<Comment>Рабочий режим</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Catalogs/ГрафикиРаботы/Forms/ФормаЭлемента/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОбновлениеОтображения();
КонецПроцедуры

&НаКлиенте
Процедура ОбновлениеОтображения(Элемент = Неопределено)

// Инициализация переменных
//-------------------------------------------------------------------------------------------------
	НеРаботает = ПредопределенноеЗначение("Перечисление.РежимРаботыОбъекта.Выходной");

// Будний день: доступность реквизитов с часами работы
//-------------------------------------------------------------------------------------------------
	Доступно = ЗначениеЗаполнено(Объект.БудРежим);
	Доступно = Доступно И (Объект.БудРежим <> НеРаботает);
	Элементы.ГруппаБуднийЧасы.ТолькоПросмотр = (НЕ Доступно);

// Суббота: доступность реквизитов с часами работы
//-------------------------------------------------------------------------------------------------
	Доступно = ЗначениеЗаполнено(Объект.СубРежим);
	Доступно = Доступно И (Объект.СубРежим <> НеРаботает);
	Элементы.ГруппаСубботаЧасы.ТолькоПросмотр = (НЕ Доступно);

// Воскресенье: доступность реквизитов с часами работы
//-------------------------------------------------------------------------------------------------
	Доступно = ЗначениеЗаполнено(Объект.ВскРежим);
	Доступно = Доступно И (Объект.ВскРежим <> НеРаботает);
	Элементы.ГруппаВоскресеньеЧасы.ТолькоПросмотр = (НЕ Доступно);
КонецПроцедуры

//-------------------------------------------------------------------------------------------------

&НаКлиенте
Процедура РежимПриИзменении(Элемент)

// Инициализация переменных
//-------------------------------------------------------------------------------------------------
	НеРаботает = ПредопределенноеЗначение("Перечисление.РежимРаботыОбъекта.Выходной");
	Префикс = Лев(СокрЛП(Элемент.Имя),3);

// Если установлен нерабочий режим, то очистим значения реквизитов отвечающих за часы работы
//-------------------------------------------------------------------------------------------------
	Если (Объект[Префикс + "Режим"] = ПредопределенноеЗначение("Перечисление.РежимРаботыОбъекта.Выходной")) Тогда
		Объект[Префикс + "Нач"] = Неопределено;
		Объект[Префикс + "Кон"] = Неопределено;
	КонецЕсли;

	ОбновлениеОтображения();
КонецПроцедуры
